20240115054325-computing_history.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-03 Tue 07:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Computing History</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Computing History</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2c4209a">1. Computing History</a>
<ul>
<li><a href="#orgeb7b609">1.1. Mechanical Machines (before <code>1930</code>)</a></li>
<li><a href="#org5987c52">1.2. Electronic Computers (<code>1930-1950</code>)</a></li>
<li><a href="#orga29e302">1.3. Computer Generations (<code>1950-Present</code>)</a>
<ul>
<li><a href="#orga7f7e91">1.3.1. First Generation (<code>1950-1959</code>)</a></li>
<li><a href="#org51f409e">1.3.2. Second Generation (<code>1959-1965</code>)</a></li>
<li><a href="#org553bcba">1.3.3. Third Generation (<code>1965-1975</code>)</a></li>
<li><a href="#org7d113b9">1.3.4. Fourth Generation (<code>1975-1985</code>)</a></li>
<li><a href="#org428700b">1.3.5. Fifth Generation (<code>1985</code>)</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2c4209a" class="outline-2">
<h2 id="org2c4209a"><span class="section-number-2">1.</span> Computing History</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgeb7b609" class="outline-3">
<h3 id="orgeb7b609"><span class="section-number-3">1.1.</span> Mechanical Machines (before <code>1930</code>)</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="20240115054607-pascaline.html#ID-5f1a7be8-3673-4ead-b491-b1fd65a064c8">Pascaline</a></li>
<li><a href="20240115054813-leibniz_wheel.html#ID-2393b3a8-d90a-4962-9d91-182d6f9e8fd2">Leibniz Wheel</a></li>
<li><a href="20230817063426-difference_engine.html#ID-c835f120-2552-4c43-b7ef-13303b0841d8">Difference Engine</a></li>
<li><a href="20230817063624-analytical_engine.html#ID-d432f62d-8436-4492-b4fa-ef4fa5331c22">Analytical Engine</a></li>
<li><a href="20240115055334-herman_hollerith.html#ID-619d9e09-673e-4d65-ad57-75085679520c">Herman Hollerith</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5987c52" class="outline-3">
<h3 id="org5987c52"><span class="section-number-3">1.2.</span> Electronic Computers (<code>1930-1950</code>)</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="20240115055920-atanasoff_berry_computer_abc.html#ID-c7dd004e-cc7b-45dc-a962-c4ab72898045">Atanasoff Berry Computer (ABC)</a></li>
<li><a href="20240115060722-z1.html#ID-2e14052c-796b-475a-ae43-8a9ba5a2ac73">Z1</a></li>
<li><a href="20240115060930-mark_1.html#ID-a51b0a6d-7cef-449c-8e16-d8f8f7f5a32d">Mark 1</a></li>
<li><a href="20230817063938-turing_welchman_bombe.html#ID-d0fa831e-3a0a-4e0c-8bc4-0397ee4aec2a">Colossus</a></li>
<li><a href="20240115061453-electronic_numerical_integratior_and_calculator_eniac.html#ID-b004bf6d-8030-4d9e-a2c3-b612111865ca">ENIAC</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga29e302" class="outline-3">
<h3 id="orga29e302"><span class="section-number-3">1.3.</span> Computer Generations (<code>1950-Present</code>)</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Computers built after <code>1950</code> more or less follow the <a href="20240115051925-von_neumann_model.html#ID-0dfb80a3-bb69-4347-a822-1227fece944a">von Neumann Model</a>. (Storing data and the <a href="20240115051011-program.html#ID-899ca310-9704-46b5-9177-b2d76a875456">program</a> in memory)
</p>
</div>

<div id="outline-container-orga7f7e91" class="outline-4">
<h4 id="orga7f7e91"><span class="section-number-4">1.3.1.</span> First Generation (<code>1950-1959</code>)</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Characterized by the emergence of commercial computers.
</p>

<p>
Computers were <b>bulky</b> and used <b>vacuum tubes</b> as electronic switches.
</p>

<p>
At this time, computers were affordable <b>only</b> by big organizations.
</p>
</div>
</div>

<div id="outline-container-org51f409e" class="outline-4">
<h4 id="org51f409e"><span class="section-number-4">1.3.2.</span> Second Generation (<code>1959-1965</code>)</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Used transistors instead of vacuum tubes.
</p>

<p>
This reduced the size of computers, as well as their cost, and made them affordable to small and medium-size corporations.
</p>

<p>
Two high-level programming languages, <a href="20240115062401-fortran.html#ID-0cb09013-1748-4014-b00b-9fed24f2fdf1">FORTRAN</a> and <a href="20230820052156-cobol.html#ID-f5621d16-9902-47ee-b992-e1381bb0c09c">COBOL</a>, were invented and made programming easier.
</p>

<p>
These two languages separated the programming task from the computer operation task.
</p>
</div>
</div>

<div id="outline-container-org553bcba" class="outline-4">
<h4 id="org553bcba"><span class="section-number-4">1.3.3.</span> Third Generation (<code>1965-1975</code>)</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
The invention of the integrated circuit (transistors, wiring, and other components on a single chip) reduced the cost and size of computers even further.
</p>

<p>
Minicomputers appeared on the market.
</p>

<p>
<code>Canned programs</code>, popularly known as software packages, became available.
</p>
</div>
</div>

<div id="outline-container-org7d113b9" class="outline-4">
<h4 id="org7d113b9"><span class="section-number-4">1.3.4.</span> Fourth Generation (<code>1975-1985</code>)</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
Saw the appearance of microcomputers.
<a href="20240115062535-altair_8800.html#ID-66da5f43-460b-4c43-9a03-bf782167b278">Altair 8800</a>
Advances in the electronics industry allowed whole computer subsystems to fit on a <code>single circuit board</code>.
</p>
</div>
</div>

<div id="outline-container-org428700b" class="outline-4">
<h4 id="org428700b"><span class="section-number-4">1.3.5.</span> Fifth Generation (<code>1985</code>)</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
It has witnessed the appearance of <code>laptop</code> and <code>palmtop</code> computers, improvements in secondary storage media (CD-ROM, DVD, and
so on), the use of multimedia, and the phenomenon of virtual reality.
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
